# Direction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Line..::..Direction Property
Line Class See Also
---
Returns the direction of the line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Direction { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Direction As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Direction {
	XYZ^ get ();
}
```

# See Also
Line Class
Autodesk.Revit.DB Namespace